"""
Создать список, содержащий цены на товары (10–20 товаров), например:
[57.8, 46.51, 97, ...]
"""

price = [12, 65, 123, 56, 10.5, 7.7, 36, 9, 56.3, 842]
print(len(price))

print(f"{})
# Тут я сдался, эта тема очень сложно дается, буду тренироваться на задачках в интернете
